II/A_prescription/identity_with_conv/tutorial/CROSSLOT/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes                                                                 
{
    default         Euler; 
}

gradSchemes
{
    default         Gauss linear;
    grad(U)	    Gauss linear;
    grad(p)	    Gauss linear;
}


divSchemes
{
    default  none;
    div(phi,U)                 			GaussDefCmpw cubista;
    div((nuEff*dev2(T(grad(U))))) 		Gauss linear;
    div(grad(U))				Gauss linear;
    div(tau_p)					Gauss linear;
    div(phi,((grad(U)|2)+(grad(U).T()|2)))	GaussDefCmpw cubista;
    div((grad(U).T()&grad(U))) 	                Gauss linear;
    div(phi,laplacian((lambda*nu_p),U)) 	GaussDefCmpw cubista;
}

laplacianSchemes
{
    default		    Gauss linear orthogonal;         
    laplacian(U)	    Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;//orthogonal
}
fluxRequired
{
    default	no;
    p		;
}

// ************************************************************************* //
